""" Задание """

name = "Didjey"
print(name[0])
print(name[-1])
print(name[-3:])
print(name[::-1])
print(name[1:6:2])

# 123456
# Didjey
# 012345

peremennay = "Мороз и солнце; день чудесный!\nЕще ты дремлешь, друг прелестный —\nПора, красавица, проснись:\nОткрой сомкнуты негой взоры\nНавстречу северной Авроры,\nЗвездою севера явись!"
print(peremennay)
print(peremennay[8:15])



# TODO: Заметки
## \n - переход на другую строку (ENTER)